/* automatically generated by rust-bindgen 0.72.1 */

pub const PLUGIN_API_VERSION_MAJOR: u32 = 3;
pub const PLUGIN_API_VERSION_MINOR: u32 = 12;
pub const PLUGIN_API_VERSION_PATCH: u32 = 0;
pub const PLUGIN_MAX_ERRLEN: u32 = 1024;
pub const PLUGIN_EVENT_PAYLOAD_OFFSET: u32 = 38;
pub type ss_plugin_bool = u32;
pub const ss_plugin_field_type_FTYPE_UINT64: ss_plugin_field_type = 8;
pub const ss_plugin_field_type_FTYPE_STRING: ss_plugin_field_type = 9;
pub const ss_plugin_field_type_FTYPE_RELTIME: ss_plugin_field_type = 20;
pub const ss_plugin_field_type_FTYPE_ABSTIME: ss_plugin_field_type = 21;
pub const ss_plugin_field_type_FTYPE_BOOL: ss_plugin_field_type = 25;
pub const ss_plugin_field_type_FTYPE_IPADDR: ss_plugin_field_type = 40;
pub const ss_plugin_field_type_FTYPE_IPNET: ss_plugin_field_type = 41;
pub type ss_plugin_field_type = ::std::os::raw::c_uint;
pub const ss_plugin_rc_SS_PLUGIN_SUCCESS: ss_plugin_rc = 0;
pub const ss_plugin_rc_SS_PLUGIN_FAILURE: ss_plugin_rc = 1;
pub const ss_plugin_rc_SS_PLUGIN_TIMEOUT: ss_plugin_rc = -1;
pub const ss_plugin_rc_SS_PLUGIN_EOF: ss_plugin_rc = 2;
pub const ss_plugin_rc_SS_PLUGIN_NOT_SUPPORTED: ss_plugin_rc = 3;
pub type ss_plugin_rc = ::std::os::raw::c_int;
pub const ss_plugin_schema_type_SS_PLUGIN_SCHEMA_NONE: ss_plugin_schema_type = 0;
pub const ss_plugin_schema_type_SS_PLUGIN_SCHEMA_JSON: ss_plugin_schema_type = 1;
pub type ss_plugin_schema_type = ::std::os::raw::c_uint;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct ss_plugin_event {
    pub ts: u64,
    pub tid: u64,
    pub len: u32,
    pub type_: u16,
    pub nparams: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ss_plugin_event"][::std::mem::size_of::<ss_plugin_event>() - 26usize];
    ["Alignment of ss_plugin_event"][::std::mem::align_of::<ss_plugin_event>() - 1usize];
    ["Offset of field: ss_plugin_event::ts"][::std::mem::offset_of!(ss_plugin_event, ts) - 0usize];
    ["Offset of field: ss_plugin_event::tid"]
        [::std::mem::offset_of!(ss_plugin_event, tid) - 8usize];
    ["Offset of field: ss_plugin_event::len"]
        [::std::mem::offset_of!(ss_plugin_event, len) - 16usize];
    ["Offset of field: ss_plugin_event::type_"]
        [::std::mem::offset_of!(ss_plugin_event, type_) - 20usize];
    ["Offset of field: ss_plugin_event::nparams"]
        [::std::mem::offset_of!(ss_plugin_event, nparams) - 22usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ss_plugin_event_input {
    pub evt: *const ss_plugin_event,
    pub evtnum: u64,
    pub evtsrc: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ss_plugin_event_input"][::std::mem::size_of::<ss_plugin_event_input>() - 24usize];
    ["Alignment of ss_plugin_event_input"]
        [::std::mem::align_of::<ss_plugin_event_input>() - 8usize];
    ["Offset of field: ss_plugin_event_input::evt"]
        [::std::mem::offset_of!(ss_plugin_event_input, evt) - 0usize];
    ["Offset of field: ss_plugin_event_input::evtnum"]
        [::std::mem::offset_of!(ss_plugin_event_input, evtnum) - 8usize];
    ["Offset of field: ss_plugin_event_input::evtsrc"]
        [::std::mem::offset_of!(ss_plugin_event_input, evtsrc) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ss_plugin_byte_buffer {
    pub len: u32,
    pub ptr: *const ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ss_plugin_byte_buffer"][::std::mem::size_of::<ss_plugin_byte_buffer>() - 16usize];
    ["Alignment of ss_plugin_byte_buffer"]
        [::std::mem::align_of::<ss_plugin_byte_buffer>() - 8usize];
    ["Offset of field: ss_plugin_byte_buffer::len"]
        [::std::mem::offset_of!(ss_plugin_byte_buffer, len) - 0usize];
    ["Offset of field: ss_plugin_byte_buffer::ptr"]
        [::std::mem::offset_of!(ss_plugin_byte_buffer, ptr) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ss_plugin_extract_value_offsets {
    pub start: *mut u32,
    pub length: *mut u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ss_plugin_extract_value_offsets"]
        [::std::mem::size_of::<ss_plugin_extract_value_offsets>() - 16usize];
    ["Alignment of ss_plugin_extract_value_offsets"]
        [::std::mem::align_of::<ss_plugin_extract_value_offsets>() - 8usize];
    ["Offset of field: ss_plugin_extract_value_offsets::start"]
        [::std::mem::offset_of!(ss_plugin_extract_value_offsets, start) - 0usize];
    ["Offset of field: ss_plugin_extract_value_offsets::length"]
        [::std::mem::offset_of!(ss_plugin_extract_value_offsets, length) - 8usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ss_plugin_extract_field {
    pub res: ss_plugin_extract_field__bindgen_ty_1,
    pub res_len: u64,
    pub field_id: u32,
    pub field: *const ::std::os::raw::c_char,
    pub arg_key: *const ::std::os::raw::c_char,
    pub arg_index: u64,
    pub arg_present: ss_plugin_bool,
    pub ftype: u32,
    pub flist: ss_plugin_bool,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ss_plugin_extract_field__bindgen_ty_1 {
    pub str_: *mut *const ::std::os::raw::c_char,
    pub u64_: *mut u64,
    pub u32_: *mut u32,
    pub boolean: *mut ss_plugin_bool,
    pub buf: *mut ss_plugin_byte_buffer,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ss_plugin_extract_field__bindgen_ty_1"]
        [::std::mem::size_of::<ss_plugin_extract_field__bindgen_ty_1>() - 8usize];
    ["Alignment of ss_plugin_extract_field__bindgen_ty_1"]
        [::std::mem::align_of::<ss_plugin_extract_field__bindgen_ty_1>() - 8usize];
    ["Offset of field: ss_plugin_extract_field__bindgen_ty_1::str_"]
        [::std::mem::offset_of!(ss_plugin_extract_field__bindgen_ty_1, str_) - 0usize];
    ["Offset of field: ss_plugin_extract_field__bindgen_ty_1::u64_"]
        [::std::mem::offset_of!(ss_plugin_extract_field__bindgen_ty_1, u64_) - 0usize];
    ["Offset of field: ss_plugin_extract_field__bindgen_ty_1::u32_"]
        [::std::mem::offset_of!(ss_plugin_extract_field__bindgen_ty_1, u32_) - 0usize];
    ["Offset of field: ss_plugin_extract_field__bindgen_ty_1::boolean"]
        [::std::mem::offset_of!(ss_plugin_extract_field__bindgen_ty_1, boolean) - 0usize];
    ["Offset of field: ss_plugin_extract_field__bindgen_ty_1::buf"]
        [::std::mem::offset_of!(ss_plugin_extract_field__bindgen_ty_1, buf) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ss_plugin_extract_field"][::std::mem::size_of::<ss_plugin_extract_field>() - 64usize];
    ["Alignment of ss_plugin_extract_field"]
        [::std::mem::align_of::<ss_plugin_extract_field>() - 8usize];
    ["Offset of field: ss_plugin_extract_field::res"]
        [::std::mem::offset_of!(ss_plugin_extract_field, res) - 0usize];
    ["Offset of field: ss_plugin_extract_field::res_len"]
        [::std::mem::offset_of!(ss_plugin_extract_field, res_len) - 8usize];
    ["Offset of field: ss_plugin_extract_field::field_id"]
        [::std::mem::offset_of!(ss_plugin_extract_field, field_id) - 16usize];
    ["Offset of field: ss_plugin_extract_field::field"]
        [::std::mem::offset_of!(ss_plugin_extract_field, field) - 24usize];
    ["Offset of field: ss_plugin_extract_field::arg_key"]
        [::std::mem::offset_of!(ss_plugin_extract_field, arg_key) - 32usize];
    ["Offset of field: ss_plugin_extract_field::arg_index"]
        [::std::mem::offset_of!(ss_plugin_extract_field, arg_index) - 40usize];
    ["Offset of field: ss_plugin_extract_field::arg_present"]
        [::std::mem::offset_of!(ss_plugin_extract_field, arg_present) - 48usize];
    ["Offset of field: ss_plugin_extract_field::ftype"]
        [::std::mem::offset_of!(ss_plugin_extract_field, ftype) - 52usize];
    ["Offset of field: ss_plugin_extract_field::flist"]
        [::std::mem::offset_of!(ss_plugin_extract_field, flist) - 56usize];
};
#[repr(transparent)]
#[derive(Debug)]
pub struct ss_plugin_table_t(pub ::std::os::raw::c_void);
#[repr(transparent)]
#[derive(Debug)]
pub struct ss_plugin_table_entry_t(pub ::std::os::raw::c_void);
#[repr(transparent)]
#[derive(Debug)]
pub struct ss_plugin_table_field_t(pub ::std::os::raw::c_void);
pub const ss_plugin_state_type_SS_PLUGIN_ST_INT8: ss_plugin_state_type = 1;
pub const ss_plugin_state_type_SS_PLUGIN_ST_INT16: ss_plugin_state_type = 2;
pub const ss_plugin_state_type_SS_PLUGIN_ST_INT32: ss_plugin_state_type = 3;
pub const ss_plugin_state_type_SS_PLUGIN_ST_INT64: ss_plugin_state_type = 4;
pub const ss_plugin_state_type_SS_PLUGIN_ST_UINT8: ss_plugin_state_type = 5;
pub const ss_plugin_state_type_SS_PLUGIN_ST_UINT16: ss_plugin_state_type = 6;
pub const ss_plugin_state_type_SS_PLUGIN_ST_UINT32: ss_plugin_state_type = 7;
pub const ss_plugin_state_type_SS_PLUGIN_ST_UINT64: ss_plugin_state_type = 8;
pub const ss_plugin_state_type_SS_PLUGIN_ST_STRING: ss_plugin_state_type = 9;
pub const ss_plugin_state_type_SS_PLUGIN_ST_TABLE: ss_plugin_state_type = 10;
pub const ss_plugin_state_type_SS_PLUGIN_ST_BOOL: ss_plugin_state_type = 25;
pub type ss_plugin_state_type = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub union ss_plugin_state_data {
    pub s8: i8,
    pub s16: i16,
    pub s32: i32,
    pub s64: i64,
    pub u8_: u8,
    pub u16_: u16,
    pub u32_: u32,
    pub u64_: u64,
    pub str_: *const ::std::os::raw::c_char,
    pub b: ss_plugin_bool,
    pub table: *mut ss_plugin_table_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ss_plugin_state_data"][::std::mem::size_of::<ss_plugin_state_data>() - 8usize];
    ["Alignment of ss_plugin_state_data"][::std::mem::align_of::<ss_plugin_state_data>() - 8usize];
    ["Offset of field: ss_plugin_state_data::s8"]
        [::std::mem::offset_of!(ss_plugin_state_data, s8) - 0usize];
    ["Offset of field: ss_plugin_state_data::s16"]
        [::std::mem::offset_of!(ss_plugin_state_data, s16) - 0usize];
    ["Offset of field: ss_plugin_state_data::s32"]
        [::std::mem::offset_of!(ss_plugin_state_data, s32) - 0usize];
    ["Offset of field: ss_plugin_state_data::s64"]
        [::std::mem::offset_of!(ss_plugin_state_data, s64) - 0usize];
    ["Offset of field: ss_plugin_state_data::u8_"]
        [::std::mem::offset_of!(ss_plugin_state_data, u8_) - 0usize];
    ["Offset of field: ss_plugin_state_data::u16_"]
        [::std::mem::offset_of!(ss_plugin_state_data, u16_) - 0usize];
    ["Offset of field: ss_plugin_state_data::u32_"]
        [::std::mem::offset_of!(ss_plugin_state_data, u32_) - 0usize];
    ["Offset of field: ss_plugin_state_data::u64_"]
        [::std::mem::offset_of!(ss_plugin_state_data, u64_) - 0usize];
    ["Offset of field: ss_plugin_state_data::str_"]
        [::std::mem::offset_of!(ss_plugin_state_data, str_) - 0usize];
    ["Offset of field: ss_plugin_state_data::b"]
        [::std::mem::offset_of!(ss_plugin_state_data, b) - 0usize];
    ["Offset of field: ss_plugin_state_data::table"]
        [::std::mem::offset_of!(ss_plugin_state_data, table) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ss_plugin_table_info {
    pub name: *const ::std::os::raw::c_char,
    pub key_type: ss_plugin_state_type,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ss_plugin_table_info"][::std::mem::size_of::<ss_plugin_table_info>() - 16usize];
    ["Alignment of ss_plugin_table_info"][::std::mem::align_of::<ss_plugin_table_info>() - 8usize];
    ["Offset of field: ss_plugin_table_info::name"]
        [::std::mem::offset_of!(ss_plugin_table_info, name) - 0usize];
    ["Offset of field: ss_plugin_table_info::key_type"]
        [::std::mem::offset_of!(ss_plugin_table_info, key_type) - 8usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ss_plugin_table_fieldinfo {
    pub name: *const ::std::os::raw::c_char,
    pub field_type: ss_plugin_state_type,
    pub read_only: ss_plugin_bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ss_plugin_table_fieldinfo"]
        [::std::mem::size_of::<ss_plugin_table_fieldinfo>() - 16usize];
    ["Alignment of ss_plugin_table_fieldinfo"]
        [::std::mem::align_of::<ss_plugin_table_fieldinfo>() - 8usize];
    ["Offset of field: ss_plugin_table_fieldinfo::name"]
        [::std::mem::offset_of!(ss_plugin_table_fieldinfo, name) - 0usize];
    ["Offset of field: ss_plugin_table_fieldinfo::field_type"]
        [::std::mem::offset_of!(ss_plugin_table_fieldinfo, field_type) - 8usize];
    ["Offset of field: ss_plugin_table_fieldinfo::read_only"]
        [::std::mem::offset_of!(ss_plugin_table_fieldinfo, read_only) - 12usize];
};
#[repr(transparent)]
#[derive(Debug)]
pub struct ss_plugin_owner_t(pub ::std::os::raw::c_void);
#[repr(transparent)]
#[derive(Debug)]
pub struct ss_plugin_t(pub ::std::os::raw::c_void);
#[repr(transparent)]
#[derive(Debug)]
pub struct ss_instance_t(pub ::std::os::raw::c_void);
pub const ss_plugin_log_severity_SS_PLUGIN_LOG_SEV_FATAL: ss_plugin_log_severity = 1;
pub const ss_plugin_log_severity_SS_PLUGIN_LOG_SEV_CRITICAL: ss_plugin_log_severity = 2;
pub const ss_plugin_log_severity_SS_PLUGIN_LOG_SEV_ERROR: ss_plugin_log_severity = 3;
pub const ss_plugin_log_severity_SS_PLUGIN_LOG_SEV_WARNING: ss_plugin_log_severity = 4;
pub const ss_plugin_log_severity_SS_PLUGIN_LOG_SEV_NOTICE: ss_plugin_log_severity = 5;
pub const ss_plugin_log_severity_SS_PLUGIN_LOG_SEV_INFO: ss_plugin_log_severity = 6;
pub const ss_plugin_log_severity_SS_PLUGIN_LOG_SEV_DEBUG: ss_plugin_log_severity = 7;
pub const ss_plugin_log_severity_SS_PLUGIN_LOG_SEV_TRACE: ss_plugin_log_severity = 8;
pub type ss_plugin_log_severity = ::std::os::raw::c_uint;
pub const ss_plugin_metric_value_type_SS_PLUGIN_METRIC_VALUE_TYPE_U32: ss_plugin_metric_value_type =
    0;
pub const ss_plugin_metric_value_type_SS_PLUGIN_METRIC_VALUE_TYPE_S32: ss_plugin_metric_value_type =
    1;
pub const ss_plugin_metric_value_type_SS_PLUGIN_METRIC_VALUE_TYPE_U64: ss_plugin_metric_value_type =
    2;
pub const ss_plugin_metric_value_type_SS_PLUGIN_METRIC_VALUE_TYPE_S64: ss_plugin_metric_value_type =
    3;
pub const ss_plugin_metric_value_type_SS_PLUGIN_METRIC_VALUE_TYPE_D: ss_plugin_metric_value_type =
    4;
pub const ss_plugin_metric_value_type_SS_PLUGIN_METRIC_VALUE_TYPE_F: ss_plugin_metric_value_type =
    5;
pub const ss_plugin_metric_value_type_SS_PLUGIN_METRIC_VALUE_TYPE_I: ss_plugin_metric_value_type =
    6;
pub type ss_plugin_metric_value_type = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub union ss_plugin_metric_value {
    pub u32_: u32,
    pub s32: i32,
    pub u64_: u64,
    pub s64: i64,
    pub d: f64,
    pub f: f32,
    pub i: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ss_plugin_metric_value"][::std::mem::size_of::<ss_plugin_metric_value>() - 8usize];
    ["Alignment of ss_plugin_metric_value"]
        [::std::mem::align_of::<ss_plugin_metric_value>() - 8usize];
    ["Offset of field: ss_plugin_metric_value::u32_"]
        [::std::mem::offset_of!(ss_plugin_metric_value, u32_) - 0usize];
    ["Offset of field: ss_plugin_metric_value::s32"]
        [::std::mem::offset_of!(ss_plugin_metric_value, s32) - 0usize];
    ["Offset of field: ss_plugin_metric_value::u64_"]
        [::std::mem::offset_of!(ss_plugin_metric_value, u64_) - 0usize];
    ["Offset of field: ss_plugin_metric_value::s64"]
        [::std::mem::offset_of!(ss_plugin_metric_value, s64) - 0usize];
    ["Offset of field: ss_plugin_metric_value::d"]
        [::std::mem::offset_of!(ss_plugin_metric_value, d) - 0usize];
    ["Offset of field: ss_plugin_metric_value::f"]
        [::std::mem::offset_of!(ss_plugin_metric_value, f) - 0usize];
    ["Offset of field: ss_plugin_metric_value::i"]
        [::std::mem::offset_of!(ss_plugin_metric_value, i) - 0usize];
};
pub const ss_plugin_metric_type_SS_PLUGIN_METRIC_TYPE_MONOTONIC: ss_plugin_metric_type = 0;
pub const ss_plugin_metric_type_SS_PLUGIN_METRIC_TYPE_NON_MONOTONIC: ss_plugin_metric_type = 1;
pub type ss_plugin_metric_type = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ss_plugin_metric {
    pub name: *const ::std::os::raw::c_char,
    pub type_: ss_plugin_metric_type,
    pub value: ss_plugin_metric_value,
    pub value_type: ss_plugin_metric_value_type,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ss_plugin_metric"][::std::mem::size_of::<ss_plugin_metric>() - 32usize];
    ["Alignment of ss_plugin_metric"][::std::mem::align_of::<ss_plugin_metric>() - 8usize];
    ["Offset of field: ss_plugin_metric::name"]
        [::std::mem::offset_of!(ss_plugin_metric, name) - 0usize];
    ["Offset of field: ss_plugin_metric::type_"]
        [::std::mem::offset_of!(ss_plugin_metric, type_) - 8usize];
    ["Offset of field: ss_plugin_metric::value"]
        [::std::mem::offset_of!(ss_plugin_metric, value) - 16usize];
    ["Offset of field: ss_plugin_metric::value_type"]
        [::std::mem::offset_of!(ss_plugin_metric, value_type) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ss_plugin_table_fields_vtable {
    pub list_table_fields: ::std::option::Option<
        unsafe extern "C-unwind" fn(
            t: *mut ss_plugin_table_t,
            nfields: *mut u32,
        ) -> *const ss_plugin_table_fieldinfo,
    >,
    pub get_table_field: ::std::option::Option<
        unsafe extern "C-unwind" fn(
            t: *mut ss_plugin_table_t,
            name: *const ::std::os::raw::c_char,
            data_type: ss_plugin_state_type,
        ) -> *mut ss_plugin_table_field_t,
    >,
    pub add_table_field: ::std::option::Option<
        unsafe extern "C-unwind" fn(
            t: *mut ss_plugin_table_t,
            name: *const ::std::os::raw::c_char,
            data_type: ss_plugin_state_type,
        ) -> *mut ss_plugin_table_field_t,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ss_plugin_table_fields_vtable"]
        [::std::mem::size_of::<ss_plugin_table_fields_vtable>() - 24usize];
    ["Alignment of ss_plugin_table_fields_vtable"]
        [::std::mem::align_of::<ss_plugin_table_fields_vtable>() - 8usize];
    ["Offset of field: ss_plugin_table_fields_vtable::list_table_fields"]
        [::std::mem::offset_of!(ss_plugin_table_fields_vtable, list_table_fields) - 0usize];
    ["Offset of field: ss_plugin_table_fields_vtable::get_table_field"]
        [::std::mem::offset_of!(ss_plugin_table_fields_vtable, get_table_field) - 8usize];
    ["Offset of field: ss_plugin_table_fields_vtable::add_table_field"]
        [::std::mem::offset_of!(ss_plugin_table_fields_vtable, add_table_field) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ss_plugin_table_fields_vtable_ext {
    pub list_table_fields: ::std::option::Option<
        unsafe extern "C-unwind" fn(
            t: *mut ss_plugin_table_t,
            nfields: *mut u32,
        ) -> *const ss_plugin_table_fieldinfo,
    >,
    pub get_table_field: ::std::option::Option<
        unsafe extern "C-unwind" fn(
            t: *mut ss_plugin_table_t,
            name: *const ::std::os::raw::c_char,
            data_type: ss_plugin_state_type,
        ) -> *mut ss_plugin_table_field_t,
    >,
    pub add_table_field: ::std::option::Option<
        unsafe extern "C-unwind" fn(
            t: *mut ss_plugin_table_t,
            name: *const ::std::os::raw::c_char,
            data_type: ss_plugin_state_type,
        ) -> *mut ss_plugin_table_field_t,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ss_plugin_table_fields_vtable_ext"]
        [::std::mem::size_of::<ss_plugin_table_fields_vtable_ext>() - 24usize];
    ["Alignment of ss_plugin_table_fields_vtable_ext"]
        [::std::mem::align_of::<ss_plugin_table_fields_vtable_ext>() - 8usize];
    ["Offset of field: ss_plugin_table_fields_vtable_ext::list_table_fields"]
        [::std::mem::offset_of!(ss_plugin_table_fields_vtable_ext, list_table_fields) - 0usize];
    ["Offset of field: ss_plugin_table_fields_vtable_ext::get_table_field"]
        [::std::mem::offset_of!(ss_plugin_table_fields_vtable_ext, get_table_field) - 8usize];
    ["Offset of field: ss_plugin_table_fields_vtable_ext::add_table_field"]
        [::std::mem::offset_of!(ss_plugin_table_fields_vtable_ext, add_table_field) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ss_plugin_table_reader_vtable {
    pub get_table_name: ::std::option::Option<
        unsafe extern "C-unwind" fn(t: *mut ss_plugin_table_t) -> *const ::std::os::raw::c_char,
    >,
    pub get_table_size:
        ::std::option::Option<unsafe extern "C-unwind" fn(t: *mut ss_plugin_table_t) -> u64>,
    pub get_table_entry: ::std::option::Option<
        unsafe extern "C-unwind" fn(
            t: *mut ss_plugin_table_t,
            key: *const ss_plugin_state_data,
        ) -> *mut ss_plugin_table_entry_t,
    >,
    pub read_entry_field: ::std::option::Option<
        unsafe extern "C-unwind" fn(
            t: *mut ss_plugin_table_t,
            e: *mut ss_plugin_table_entry_t,
            f: *const ss_plugin_table_field_t,
            out: *mut ss_plugin_state_data,
        ) -> ss_plugin_rc,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ss_plugin_table_reader_vtable"]
        [::std::mem::size_of::<ss_plugin_table_reader_vtable>() - 32usize];
    ["Alignment of ss_plugin_table_reader_vtable"]
        [::std::mem::align_of::<ss_plugin_table_reader_vtable>() - 8usize];
    ["Offset of field: ss_plugin_table_reader_vtable::get_table_name"]
        [::std::mem::offset_of!(ss_plugin_table_reader_vtable, get_table_name) - 0usize];
    ["Offset of field: ss_plugin_table_reader_vtable::get_table_size"]
        [::std::mem::offset_of!(ss_plugin_table_reader_vtable, get_table_size) - 8usize];
    ["Offset of field: ss_plugin_table_reader_vtable::get_table_entry"]
        [::std::mem::offset_of!(ss_plugin_table_reader_vtable, get_table_entry) - 16usize];
    ["Offset of field: ss_plugin_table_reader_vtable::read_entry_field"]
        [::std::mem::offset_of!(ss_plugin_table_reader_vtable, read_entry_field) - 24usize];
};
#[repr(transparent)]
#[derive(Debug)]
pub struct ss_plugin_table_iterator_state_t(pub ::std::os::raw::c_void);
pub type ss_plugin_table_iterator_func_t = ::std::option::Option<
    unsafe extern "C-unwind" fn(
        s: *mut ss_plugin_table_iterator_state_t,
        e: *mut ss_plugin_table_entry_t,
    ) -> ss_plugin_bool,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ss_plugin_table_reader_vtable_ext {
    pub get_table_name: ::std::option::Option<
        unsafe extern "C-unwind" fn(t: *mut ss_plugin_table_t) -> *const ::std::os::raw::c_char,
    >,
    pub get_table_size:
        ::std::option::Option<unsafe extern "C-unwind" fn(t: *mut ss_plugin_table_t) -> u64>,
    pub get_table_entry: ::std::option::Option<
        unsafe extern "C-unwind" fn(
            t: *mut ss_plugin_table_t,
            key: *const ss_plugin_state_data,
        ) -> *mut ss_plugin_table_entry_t,
    >,
    pub read_entry_field: ::std::option::Option<
        unsafe extern "C-unwind" fn(
            t: *mut ss_plugin_table_t,
            e: *mut ss_plugin_table_entry_t,
            f: *const ss_plugin_table_field_t,
            out: *mut ss_plugin_state_data,
        ) -> ss_plugin_rc,
    >,
    pub release_table_entry: ::std::option::Option<
        unsafe extern "C-unwind" fn(t: *mut ss_plugin_table_t, e: *mut ss_plugin_table_entry_t),
    >,
    pub iterate_entries: ::std::option::Option<
        unsafe extern "C-unwind" fn(
            t: *mut ss_plugin_table_t,
            it: ss_plugin_table_iterator_func_t,
            s: *mut ss_plugin_table_iterator_state_t,
        ) -> ss_plugin_bool,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ss_plugin_table_reader_vtable_ext"]
        [::std::mem::size_of::<ss_plugin_table_reader_vtable_ext>() - 48usize];
    ["Alignment of ss_plugin_table_reader_vtable_ext"]
        [::std::mem::align_of::<ss_plugin_table_reader_vtable_ext>() - 8usize];
    ["Offset of field: ss_plugin_table_reader_vtable_ext::get_table_name"]
        [::std::mem::offset_of!(ss_plugin_table_reader_vtable_ext, get_table_name) - 0usize];
    ["Offset of field: ss_plugin_table_reader_vtable_ext::get_table_size"]
        [::std::mem::offset_of!(ss_plugin_table_reader_vtable_ext, get_table_size) - 8usize];
    ["Offset of field: ss_plugin_table_reader_vtable_ext::get_table_entry"]
        [::std::mem::offset_of!(ss_plugin_table_reader_vtable_ext, get_table_entry) - 16usize];
    ["Offset of field: ss_plugin_table_reader_vtable_ext::read_entry_field"]
        [::std::mem::offset_of!(ss_plugin_table_reader_vtable_ext, read_entry_field) - 24usize];
    ["Offset of field: ss_plugin_table_reader_vtable_ext::release_table_entry"]
        [::std::mem::offset_of!(ss_plugin_table_reader_vtable_ext, release_table_entry) - 32usize];
    ["Offset of field: ss_plugin_table_reader_vtable_ext::iterate_entries"]
        [::std::mem::offset_of!(ss_plugin_table_reader_vtable_ext, iterate_entries) - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ss_plugin_table_writer_vtable {
    pub clear_table: ::std::option::Option<
        unsafe extern "C-unwind" fn(t: *mut ss_plugin_table_t) -> ss_plugin_rc,
    >,
    pub erase_table_entry: ::std::option::Option<
        unsafe extern "C-unwind" fn(
            t: *mut ss_plugin_table_t,
            key: *const ss_plugin_state_data,
        ) -> ss_plugin_rc,
    >,
    pub create_table_entry: ::std::option::Option<
        unsafe extern "C-unwind" fn(t: *mut ss_plugin_table_t) -> *mut ss_plugin_table_entry_t,
    >,
    pub destroy_table_entry: ::std::option::Option<
        unsafe extern "C-unwind" fn(t: *mut ss_plugin_table_t, e: *mut ss_plugin_table_entry_t),
    >,
    pub add_table_entry: ::std::option::Option<
        unsafe extern "C-unwind" fn(
            t: *mut ss_plugin_table_t,
            key: *const ss_plugin_state_data,
            entry: *mut ss_plugin_table_entry_t,
        ) -> *mut ss_plugin_table_entry_t,
    >,
    pub write_entry_field: ::std::option::Option<
        unsafe extern "C-unwind" fn(
            t: *mut ss_plugin_table_t,
            e: *mut ss_plugin_table_entry_t,
            f: *const ss_plugin_table_field_t,
            in_: *const ss_plugin_state_data,
        ) -> ss_plugin_rc,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ss_plugin_table_writer_vtable"]
        [::std::mem::size_of::<ss_plugin_table_writer_vtable>() - 48usize];
    ["Alignment of ss_plugin_table_writer_vtable"]
        [::std::mem::align_of::<ss_plugin_table_writer_vtable>() - 8usize];
    ["Offset of field: ss_plugin_table_writer_vtable::clear_table"]
        [::std::mem::offset_of!(ss_plugin_table_writer_vtable, clear_table) - 0usize];
    ["Offset of field: ss_plugin_table_writer_vtable::erase_table_entry"]
        [::std::mem::offset_of!(ss_plugin_table_writer_vtable, erase_table_entry) - 8usize];
    ["Offset of field: ss_plugin_table_writer_vtable::create_table_entry"]
        [::std::mem::offset_of!(ss_plugin_table_writer_vtable, create_table_entry) - 16usize];
    ["Offset of field: ss_plugin_table_writer_vtable::destroy_table_entry"]
        [::std::mem::offset_of!(ss_plugin_table_writer_vtable, destroy_table_entry) - 24usize];
    ["Offset of field: ss_plugin_table_writer_vtable::add_table_entry"]
        [::std::mem::offset_of!(ss_plugin_table_writer_vtable, add_table_entry) - 32usize];
    ["Offset of field: ss_plugin_table_writer_vtable::write_entry_field"]
        [::std::mem::offset_of!(ss_plugin_table_writer_vtable, write_entry_field) - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ss_plugin_table_writer_vtable_ext {
    pub clear_table: ::std::option::Option<
        unsafe extern "C-unwind" fn(t: *mut ss_plugin_table_t) -> ss_plugin_rc,
    >,
    pub erase_table_entry: ::std::option::Option<
        unsafe extern "C-unwind" fn(
            t: *mut ss_plugin_table_t,
            key: *const ss_plugin_state_data,
        ) -> ss_plugin_rc,
    >,
    pub create_table_entry: ::std::option::Option<
        unsafe extern "C-unwind" fn(t: *mut ss_plugin_table_t) -> *mut ss_plugin_table_entry_t,
    >,
    pub destroy_table_entry: ::std::option::Option<
        unsafe extern "C-unwind" fn(t: *mut ss_plugin_table_t, e: *mut ss_plugin_table_entry_t),
    >,
    pub add_table_entry: ::std::option::Option<
        unsafe extern "C-unwind" fn(
            t: *mut ss_plugin_table_t,
            key: *const ss_plugin_state_data,
            entry: *mut ss_plugin_table_entry_t,
        ) -> *mut ss_plugin_table_entry_t,
    >,
    pub write_entry_field: ::std::option::Option<
        unsafe extern "C-unwind" fn(
            t: *mut ss_plugin_table_t,
            e: *mut ss_plugin_table_entry_t,
            f: *const ss_plugin_table_field_t,
            in_: *const ss_plugin_state_data,
        ) -> ss_plugin_rc,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ss_plugin_table_writer_vtable_ext"]
        [::std::mem::size_of::<ss_plugin_table_writer_vtable_ext>() - 48usize];
    ["Alignment of ss_plugin_table_writer_vtable_ext"]
        [::std::mem::align_of::<ss_plugin_table_writer_vtable_ext>() - 8usize];
    ["Offset of field: ss_plugin_table_writer_vtable_ext::clear_table"]
        [::std::mem::offset_of!(ss_plugin_table_writer_vtable_ext, clear_table) - 0usize];
    ["Offset of field: ss_plugin_table_writer_vtable_ext::erase_table_entry"]
        [::std::mem::offset_of!(ss_plugin_table_writer_vtable_ext, erase_table_entry) - 8usize];
    ["Offset of field: ss_plugin_table_writer_vtable_ext::create_table_entry"]
        [::std::mem::offset_of!(ss_plugin_table_writer_vtable_ext, create_table_entry) - 16usize];
    ["Offset of field: ss_plugin_table_writer_vtable_ext::destroy_table_entry"]
        [::std::mem::offset_of!(ss_plugin_table_writer_vtable_ext, destroy_table_entry) - 24usize];
    ["Offset of field: ss_plugin_table_writer_vtable_ext::add_table_entry"]
        [::std::mem::offset_of!(ss_plugin_table_writer_vtable_ext, add_table_entry) - 32usize];
    ["Offset of field: ss_plugin_table_writer_vtable_ext::write_entry_field"]
        [::std::mem::offset_of!(ss_plugin_table_writer_vtable_ext, write_entry_field) - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ss_plugin_table_input {
    pub name: *const ::std::os::raw::c_char,
    pub key_type: ss_plugin_state_type,
    pub table: *mut ss_plugin_table_t,
    pub reader: ss_plugin_table_reader_vtable,
    pub writer: ss_plugin_table_writer_vtable,
    pub fields: ss_plugin_table_fields_vtable,
    pub reader_ext: *mut ss_plugin_table_reader_vtable_ext,
    pub writer_ext: *mut ss_plugin_table_writer_vtable_ext,
    pub fields_ext: *mut ss_plugin_table_fields_vtable_ext,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ss_plugin_table_input"][::std::mem::size_of::<ss_plugin_table_input>() - 152usize];
    ["Alignment of ss_plugin_table_input"]
        [::std::mem::align_of::<ss_plugin_table_input>() - 8usize];
    ["Offset of field: ss_plugin_table_input::name"]
        [::std::mem::offset_of!(ss_plugin_table_input, name) - 0usize];
    ["Offset of field: ss_plugin_table_input::key_type"]
        [::std::mem::offset_of!(ss_plugin_table_input, key_type) - 8usize];
    ["Offset of field: ss_plugin_table_input::table"]
        [::std::mem::offset_of!(ss_plugin_table_input, table) - 16usize];
    ["Offset of field: ss_plugin_table_input::reader"]
        [::std::mem::offset_of!(ss_plugin_table_input, reader) - 24usize];
    ["Offset of field: ss_plugin_table_input::writer"]
        [::std::mem::offset_of!(ss_plugin_table_input, writer) - 56usize];
    ["Offset of field: ss_plugin_table_input::fields"]
        [::std::mem::offset_of!(ss_plugin_table_input, fields) - 104usize];
    ["Offset of field: ss_plugin_table_input::reader_ext"]
        [::std::mem::offset_of!(ss_plugin_table_input, reader_ext) - 128usize];
    ["Offset of field: ss_plugin_table_input::writer_ext"]
        [::std::mem::offset_of!(ss_plugin_table_input, writer_ext) - 136usize];
    ["Offset of field: ss_plugin_table_input::fields_ext"]
        [::std::mem::offset_of!(ss_plugin_table_input, fields_ext) - 144usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ss_plugin_init_tables_input {
    pub list_tables: ::std::option::Option<
        unsafe extern "C-unwind" fn(
            o: *mut ss_plugin_owner_t,
            ntables: *mut u32,
        ) -> *mut ss_plugin_table_info,
    >,
    pub get_table: ::std::option::Option<
        unsafe extern "C-unwind" fn(
            o: *mut ss_plugin_owner_t,
            name: *const ::std::os::raw::c_char,
            key_type: ss_plugin_state_type,
        ) -> *mut ss_plugin_table_t,
    >,
    pub add_table: ::std::option::Option<
        unsafe extern "C-unwind" fn(
            o: *mut ss_plugin_owner_t,
            in_: *const ss_plugin_table_input,
        ) -> ss_plugin_rc,
    >,
    pub fields: ss_plugin_table_fields_vtable,
    pub fields_ext: *mut ss_plugin_table_fields_vtable_ext,
    pub reader_ext: *mut ss_plugin_table_reader_vtable_ext,
    pub writer_ext: *mut ss_plugin_table_writer_vtable_ext,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ss_plugin_init_tables_input"]
        [::std::mem::size_of::<ss_plugin_init_tables_input>() - 72usize];
    ["Alignment of ss_plugin_init_tables_input"]
        [::std::mem::align_of::<ss_plugin_init_tables_input>() - 8usize];
    ["Offset of field: ss_plugin_init_tables_input::list_tables"]
        [::std::mem::offset_of!(ss_plugin_init_tables_input, list_tables) - 0usize];
    ["Offset of field: ss_plugin_init_tables_input::get_table"]
        [::std::mem::offset_of!(ss_plugin_init_tables_input, get_table) - 8usize];
    ["Offset of field: ss_plugin_init_tables_input::add_table"]
        [::std::mem::offset_of!(ss_plugin_init_tables_input, add_table) - 16usize];
    ["Offset of field: ss_plugin_init_tables_input::fields"]
        [::std::mem::offset_of!(ss_plugin_init_tables_input, fields) - 24usize];
    ["Offset of field: ss_plugin_init_tables_input::fields_ext"]
        [::std::mem::offset_of!(ss_plugin_init_tables_input, fields_ext) - 48usize];
    ["Offset of field: ss_plugin_init_tables_input::reader_ext"]
        [::std::mem::offset_of!(ss_plugin_init_tables_input, reader_ext) - 56usize];
    ["Offset of field: ss_plugin_init_tables_input::writer_ext"]
        [::std::mem::offset_of!(ss_plugin_init_tables_input, writer_ext) - 64usize];
};
pub type ss_plugin_log_fn_t = ::std::option::Option<
    unsafe extern "C-unwind" fn(
        o: *mut ss_plugin_owner_t,
        component: *const ::std::os::raw::c_char,
        msg: *const ::std::os::raw::c_char,
        sev: ss_plugin_log_severity,
    ),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ss_plugin_init_input {
    pub config: *const ::std::os::raw::c_char,
    pub owner: *mut ss_plugin_owner_t,
    pub get_owner_last_error: ::std::option::Option<
        unsafe extern "C-unwind" fn(o: *mut ss_plugin_owner_t) -> *const ::std::os::raw::c_char,
    >,
    pub tables: *const ss_plugin_init_tables_input,
    pub log_fn: ss_plugin_log_fn_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ss_plugin_init_input"][::std::mem::size_of::<ss_plugin_init_input>() - 40usize];
    ["Alignment of ss_plugin_init_input"][::std::mem::align_of::<ss_plugin_init_input>() - 8usize];
    ["Offset of field: ss_plugin_init_input::config"]
        [::std::mem::offset_of!(ss_plugin_init_input, config) - 0usize];
    ["Offset of field: ss_plugin_init_input::owner"]
        [::std::mem::offset_of!(ss_plugin_init_input, owner) - 8usize];
    ["Offset of field: ss_plugin_init_input::get_owner_last_error"]
        [::std::mem::offset_of!(ss_plugin_init_input, get_owner_last_error) - 16usize];
    ["Offset of field: ss_plugin_init_input::tables"]
        [::std::mem::offset_of!(ss_plugin_init_input, tables) - 24usize];
    ["Offset of field: ss_plugin_init_input::log_fn"]
        [::std::mem::offset_of!(ss_plugin_init_input, log_fn) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ss_plugin_field_extract_input {
    pub owner: *mut ss_plugin_owner_t,
    pub get_owner_last_error: ::std::option::Option<
        unsafe extern "C-unwind" fn(o: *mut ss_plugin_owner_t) -> *const ::std::os::raw::c_char,
    >,
    pub num_fields: u32,
    pub fields: *mut ss_plugin_extract_field,
    pub table_reader: ss_plugin_table_reader_vtable,
    pub table_reader_ext: *mut ss_plugin_table_reader_vtable_ext,
    pub value_offsets: *mut ss_plugin_extract_value_offsets,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ss_plugin_field_extract_input"]
        [::std::mem::size_of::<ss_plugin_field_extract_input>() - 80usize];
    ["Alignment of ss_plugin_field_extract_input"]
        [::std::mem::align_of::<ss_plugin_field_extract_input>() - 8usize];
    ["Offset of field: ss_plugin_field_extract_input::owner"]
        [::std::mem::offset_of!(ss_plugin_field_extract_input, owner) - 0usize];
    ["Offset of field: ss_plugin_field_extract_input::get_owner_last_error"]
        [::std::mem::offset_of!(ss_plugin_field_extract_input, get_owner_last_error) - 8usize];
    ["Offset of field: ss_plugin_field_extract_input::num_fields"]
        [::std::mem::offset_of!(ss_plugin_field_extract_input, num_fields) - 16usize];
    ["Offset of field: ss_plugin_field_extract_input::fields"]
        [::std::mem::offset_of!(ss_plugin_field_extract_input, fields) - 24usize];
    ["Offset of field: ss_plugin_field_extract_input::table_reader"]
        [::std::mem::offset_of!(ss_plugin_field_extract_input, table_reader) - 32usize];
    ["Offset of field: ss_plugin_field_extract_input::table_reader_ext"]
        [::std::mem::offset_of!(ss_plugin_field_extract_input, table_reader_ext) - 64usize];
    ["Offset of field: ss_plugin_field_extract_input::value_offsets"]
        [::std::mem::offset_of!(ss_plugin_field_extract_input, value_offsets) - 72usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ss_plugin_event_parse_input {
    pub owner: *mut ss_plugin_owner_t,
    pub get_owner_last_error: ::std::option::Option<
        unsafe extern "C-unwind" fn(o: *mut ss_plugin_owner_t) -> *const ::std::os::raw::c_char,
    >,
    pub table_reader: ss_plugin_table_reader_vtable,
    pub table_writer: ss_plugin_table_writer_vtable,
    pub table_reader_ext: *mut ss_plugin_table_reader_vtable_ext,
    pub table_writer_ext: *mut ss_plugin_table_writer_vtable_ext,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ss_plugin_event_parse_input"]
        [::std::mem::size_of::<ss_plugin_event_parse_input>() - 112usize];
    ["Alignment of ss_plugin_event_parse_input"]
        [::std::mem::align_of::<ss_plugin_event_parse_input>() - 8usize];
    ["Offset of field: ss_plugin_event_parse_input::owner"]
        [::std::mem::offset_of!(ss_plugin_event_parse_input, owner) - 0usize];
    ["Offset of field: ss_plugin_event_parse_input::get_owner_last_error"]
        [::std::mem::offset_of!(ss_plugin_event_parse_input, get_owner_last_error) - 8usize];
    ["Offset of field: ss_plugin_event_parse_input::table_reader"]
        [::std::mem::offset_of!(ss_plugin_event_parse_input, table_reader) - 16usize];
    ["Offset of field: ss_plugin_event_parse_input::table_writer"]
        [::std::mem::offset_of!(ss_plugin_event_parse_input, table_writer) - 48usize];
    ["Offset of field: ss_plugin_event_parse_input::table_reader_ext"]
        [::std::mem::offset_of!(ss_plugin_event_parse_input, table_reader_ext) - 96usize];
    ["Offset of field: ss_plugin_event_parse_input::table_writer_ext"]
        [::std::mem::offset_of!(ss_plugin_event_parse_input, table_writer_ext) - 104usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ss_plugin_set_config_input {
    pub config: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ss_plugin_set_config_input"]
        [::std::mem::size_of::<ss_plugin_set_config_input>() - 8usize];
    ["Alignment of ss_plugin_set_config_input"]
        [::std::mem::align_of::<ss_plugin_set_config_input>() - 8usize];
    ["Offset of field: ss_plugin_set_config_input::config"]
        [::std::mem::offset_of!(ss_plugin_set_config_input, config) - 0usize];
};
#[repr(transparent)]
#[derive(Debug)]
pub struct ss_plugin_routine_t(pub ::std::os::raw::c_void);
#[repr(transparent)]
#[derive(Debug)]
pub struct ss_plugin_routine_state_t(pub ::std::os::raw::c_void);
pub type ss_plugin_routine_fn_t = ::std::option::Option<
    unsafe extern "C-unwind" fn(
        s: *mut ss_plugin_t,
        i: *mut ss_plugin_routine_state_t,
    ) -> ss_plugin_bool,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ss_plugin_routine_vtable {
    pub subscribe: ::std::option::Option<
        unsafe extern "C-unwind" fn(
            o: *mut ss_plugin_owner_t,
            f: ss_plugin_routine_fn_t,
            i: *mut ss_plugin_routine_state_t,
        ) -> *mut ss_plugin_routine_t,
    >,
    pub unsubscribe: ::std::option::Option<
        unsafe extern "C-unwind" fn(
            o: *mut ss_plugin_owner_t,
            r: *mut ss_plugin_routine_t,
        ) -> ss_plugin_rc,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ss_plugin_routine_vtable"]
        [::std::mem::size_of::<ss_plugin_routine_vtable>() - 16usize];
    ["Alignment of ss_plugin_routine_vtable"]
        [::std::mem::align_of::<ss_plugin_routine_vtable>() - 8usize];
    ["Offset of field: ss_plugin_routine_vtable::subscribe"]
        [::std::mem::offset_of!(ss_plugin_routine_vtable, subscribe) - 0usize];
    ["Offset of field: ss_plugin_routine_vtable::unsubscribe"]
        [::std::mem::offset_of!(ss_plugin_routine_vtable, unsubscribe) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ss_plugin_capture_listen_input {
    pub owner: *mut ss_plugin_owner_t,
    pub routine: *mut ss_plugin_routine_vtable,
    pub table_reader_ext: *mut ss_plugin_table_reader_vtable_ext,
    pub table_writer_ext: *mut ss_plugin_table_writer_vtable_ext,
    pub get_owner_last_error: ::std::option::Option<
        unsafe extern "C-unwind" fn(o: *mut ss_plugin_owner_t) -> *const ::std::os::raw::c_char,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ss_plugin_capture_listen_input"]
        [::std::mem::size_of::<ss_plugin_capture_listen_input>() - 40usize];
    ["Alignment of ss_plugin_capture_listen_input"]
        [::std::mem::align_of::<ss_plugin_capture_listen_input>() - 8usize];
    ["Offset of field: ss_plugin_capture_listen_input::owner"]
        [::std::mem::offset_of!(ss_plugin_capture_listen_input, owner) - 0usize];
    ["Offset of field: ss_plugin_capture_listen_input::routine"]
        [::std::mem::offset_of!(ss_plugin_capture_listen_input, routine) - 8usize];
    ["Offset of field: ss_plugin_capture_listen_input::table_reader_ext"]
        [::std::mem::offset_of!(ss_plugin_capture_listen_input, table_reader_ext) - 16usize];
    ["Offset of field: ss_plugin_capture_listen_input::table_writer_ext"]
        [::std::mem::offset_of!(ss_plugin_capture_listen_input, table_writer_ext) - 24usize];
    ["Offset of field: ss_plugin_capture_listen_input::get_owner_last_error"]
        [::std::mem::offset_of!(ss_plugin_capture_listen_input, get_owner_last_error) - 32usize];
};
pub type ss_plugin_async_event_handler_t = ::std::option::Option<
    unsafe extern "C-unwind" fn(
        o: *mut ss_plugin_owner_t,
        evt: *const ss_plugin_event,
        err: *mut ::std::os::raw::c_char,
    ) -> ss_plugin_rc,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct plugin_api {
    pub get_required_api_version:
        ::std::option::Option<unsafe extern "C-unwind" fn() -> *const ::std::os::raw::c_char>,
    pub get_init_schema: ::std::option::Option<
        unsafe extern "C-unwind" fn(
            schema_type: *mut ss_plugin_schema_type,
        ) -> *const ::std::os::raw::c_char,
    >,
    pub init: ::std::option::Option<
        unsafe extern "C-unwind" fn(
            input: *const ss_plugin_init_input,
            rc: *mut ss_plugin_rc,
        ) -> *mut ss_plugin_t,
    >,
    pub destroy: ::std::option::Option<unsafe extern "C-unwind" fn(s: *mut ss_plugin_t)>,
    pub get_last_error: ::std::option::Option<
        unsafe extern "C-unwind" fn(s: *mut ss_plugin_t) -> *const ::std::os::raw::c_char,
    >,
    pub get_name:
        ::std::option::Option<unsafe extern "C-unwind" fn() -> *const ::std::os::raw::c_char>,
    pub get_description:
        ::std::option::Option<unsafe extern "C-unwind" fn() -> *const ::std::os::raw::c_char>,
    pub get_contact:
        ::std::option::Option<unsafe extern "C-unwind" fn() -> *const ::std::os::raw::c_char>,
    pub get_version:
        ::std::option::Option<unsafe extern "C-unwind" fn() -> *const ::std::os::raw::c_char>,
    pub __bindgen_anon_1: plugin_api__bindgen_ty_1,
    pub __bindgen_anon_2: plugin_api__bindgen_ty_2,
    pub __bindgen_anon_3: plugin_api__bindgen_ty_3,
    pub __bindgen_anon_4: plugin_api__bindgen_ty_4,
    pub set_config: ::std::option::Option<
        unsafe extern "C-unwind" fn(
            s: *mut ss_plugin_t,
            i: *const ss_plugin_set_config_input,
        ) -> ss_plugin_rc,
    >,
    pub get_metrics: ::std::option::Option<
        unsafe extern "C-unwind" fn(
            s: *mut ss_plugin_t,
            num_metrics: *mut u32,
        ) -> *mut ss_plugin_metric,
    >,
    pub __bindgen_anon_5: plugin_api__bindgen_ty_5,
    pub get_required_event_schema_version: ::std::option::Option<
        unsafe extern "C-unwind" fn(s: *mut ss_plugin_t) -> *const ::std::os::raw::c_char,
    >,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct plugin_api__bindgen_ty_1 {
    pub get_id: ::std::option::Option<unsafe extern "C-unwind" fn() -> u32>,
    pub get_event_source:
        ::std::option::Option<unsafe extern "C-unwind" fn() -> *const ::std::os::raw::c_char>,
    pub open: ::std::option::Option<
        unsafe extern "C-unwind" fn(
            s: *mut ss_plugin_t,
            params: *const ::std::os::raw::c_char,
            rc: *mut ss_plugin_rc,
        ) -> *mut ss_instance_t,
    >,
    pub close: ::std::option::Option<
        unsafe extern "C-unwind" fn(s: *mut ss_plugin_t, h: *mut ss_instance_t),
    >,
    pub list_open_params: ::std::option::Option<
        unsafe extern "C-unwind" fn(
            s: *mut ss_plugin_t,
            rc: *mut ss_plugin_rc,
        ) -> *const ::std::os::raw::c_char,
    >,
    pub get_progress: ::std::option::Option<
        unsafe extern "C-unwind" fn(
            s: *mut ss_plugin_t,
            h: *mut ss_instance_t,
            progress_pct: *mut u32,
        ) -> *const ::std::os::raw::c_char,
    >,
    pub event_to_string: ::std::option::Option<
        unsafe extern "C-unwind" fn(
            s: *mut ss_plugin_t,
            evt: *const ss_plugin_event_input,
        ) -> *const ::std::os::raw::c_char,
    >,
    pub next_batch: ::std::option::Option<
        unsafe extern "C-unwind" fn(
            s: *mut ss_plugin_t,
            h: *mut ss_instance_t,
            nevts: *mut u32,
            evts: *mut *mut *mut ss_plugin_event,
        ) -> ss_plugin_rc,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of plugin_api__bindgen_ty_1"]
        [::std::mem::size_of::<plugin_api__bindgen_ty_1>() - 64usize];
    ["Alignment of plugin_api__bindgen_ty_1"]
        [::std::mem::align_of::<plugin_api__bindgen_ty_1>() - 8usize];
    ["Offset of field: plugin_api__bindgen_ty_1::get_id"]
        [::std::mem::offset_of!(plugin_api__bindgen_ty_1, get_id) - 0usize];
    ["Offset of field: plugin_api__bindgen_ty_1::get_event_source"]
        [::std::mem::offset_of!(plugin_api__bindgen_ty_1, get_event_source) - 8usize];
    ["Offset of field: plugin_api__bindgen_ty_1::open"]
        [::std::mem::offset_of!(plugin_api__bindgen_ty_1, open) - 16usize];
    ["Offset of field: plugin_api__bindgen_ty_1::close"]
        [::std::mem::offset_of!(plugin_api__bindgen_ty_1, close) - 24usize];
    ["Offset of field: plugin_api__bindgen_ty_1::list_open_params"]
        [::std::mem::offset_of!(plugin_api__bindgen_ty_1, list_open_params) - 32usize];
    ["Offset of field: plugin_api__bindgen_ty_1::get_progress"]
        [::std::mem::offset_of!(plugin_api__bindgen_ty_1, get_progress) - 40usize];
    ["Offset of field: plugin_api__bindgen_ty_1::event_to_string"]
        [::std::mem::offset_of!(plugin_api__bindgen_ty_1, event_to_string) - 48usize];
    ["Offset of field: plugin_api__bindgen_ty_1::next_batch"]
        [::std::mem::offset_of!(plugin_api__bindgen_ty_1, next_batch) - 56usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct plugin_api__bindgen_ty_2 {
    pub get_extract_event_types: ::std::option::Option<
        unsafe extern "C-unwind" fn(numtypes: *mut u32, s: *mut ss_plugin_t) -> *mut u16,
    >,
    pub get_extract_event_sources:
        ::std::option::Option<unsafe extern "C-unwind" fn() -> *const ::std::os::raw::c_char>,
    pub get_fields:
        ::std::option::Option<unsafe extern "C-unwind" fn() -> *const ::std::os::raw::c_char>,
    pub extract_fields: ::std::option::Option<
        unsafe extern "C-unwind" fn(
            s: *mut ss_plugin_t,
            evt: *const ss_plugin_event_input,
            in_: *const ss_plugin_field_extract_input,
        ) -> ss_plugin_rc,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of plugin_api__bindgen_ty_2"]
        [::std::mem::size_of::<plugin_api__bindgen_ty_2>() - 32usize];
    ["Alignment of plugin_api__bindgen_ty_2"]
        [::std::mem::align_of::<plugin_api__bindgen_ty_2>() - 8usize];
    ["Offset of field: plugin_api__bindgen_ty_2::get_extract_event_types"]
        [::std::mem::offset_of!(plugin_api__bindgen_ty_2, get_extract_event_types) - 0usize];
    ["Offset of field: plugin_api__bindgen_ty_2::get_extract_event_sources"]
        [::std::mem::offset_of!(plugin_api__bindgen_ty_2, get_extract_event_sources) - 8usize];
    ["Offset of field: plugin_api__bindgen_ty_2::get_fields"]
        [::std::mem::offset_of!(plugin_api__bindgen_ty_2, get_fields) - 16usize];
    ["Offset of field: plugin_api__bindgen_ty_2::extract_fields"]
        [::std::mem::offset_of!(plugin_api__bindgen_ty_2, extract_fields) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct plugin_api__bindgen_ty_3 {
    pub get_parse_event_types: ::std::option::Option<
        unsafe extern "C-unwind" fn(numtypes: *mut u32, s: *mut ss_plugin_t) -> *mut u16,
    >,
    pub get_parse_event_sources:
        ::std::option::Option<unsafe extern "C-unwind" fn() -> *const ::std::os::raw::c_char>,
    pub parse_event: ::std::option::Option<
        unsafe extern "C-unwind" fn(
            s: *mut ss_plugin_t,
            evt: *const ss_plugin_event_input,
            in_: *const ss_plugin_event_parse_input,
        ) -> ss_plugin_rc,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of plugin_api__bindgen_ty_3"]
        [::std::mem::size_of::<plugin_api__bindgen_ty_3>() - 24usize];
    ["Alignment of plugin_api__bindgen_ty_3"]
        [::std::mem::align_of::<plugin_api__bindgen_ty_3>() - 8usize];
    ["Offset of field: plugin_api__bindgen_ty_3::get_parse_event_types"]
        [::std::mem::offset_of!(plugin_api__bindgen_ty_3, get_parse_event_types) - 0usize];
    ["Offset of field: plugin_api__bindgen_ty_3::get_parse_event_sources"]
        [::std::mem::offset_of!(plugin_api__bindgen_ty_3, get_parse_event_sources) - 8usize];
    ["Offset of field: plugin_api__bindgen_ty_3::parse_event"]
        [::std::mem::offset_of!(plugin_api__bindgen_ty_3, parse_event) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct plugin_api__bindgen_ty_4 {
    pub get_async_event_sources:
        ::std::option::Option<unsafe extern "C-unwind" fn() -> *const ::std::os::raw::c_char>,
    pub get_async_events:
        ::std::option::Option<unsafe extern "C-unwind" fn() -> *const ::std::os::raw::c_char>,
    pub set_async_event_handler: ::std::option::Option<
        unsafe extern "C-unwind" fn(
            s: *mut ss_plugin_t,
            owner: *mut ss_plugin_owner_t,
            handler: ss_plugin_async_event_handler_t,
        ) -> ss_plugin_rc,
    >,
    pub dump_state: ::std::option::Option<
        unsafe extern "C-unwind" fn(
            s: *mut ss_plugin_t,
            owner: *mut ss_plugin_owner_t,
            handler: ss_plugin_async_event_handler_t,
        ) -> ss_plugin_rc,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of plugin_api__bindgen_ty_4"]
        [::std::mem::size_of::<plugin_api__bindgen_ty_4>() - 32usize];
    ["Alignment of plugin_api__bindgen_ty_4"]
        [::std::mem::align_of::<plugin_api__bindgen_ty_4>() - 8usize];
    ["Offset of field: plugin_api__bindgen_ty_4::get_async_event_sources"]
        [::std::mem::offset_of!(plugin_api__bindgen_ty_4, get_async_event_sources) - 0usize];
    ["Offset of field: plugin_api__bindgen_ty_4::get_async_events"]
        [::std::mem::offset_of!(plugin_api__bindgen_ty_4, get_async_events) - 8usize];
    ["Offset of field: plugin_api__bindgen_ty_4::set_async_event_handler"]
        [::std::mem::offset_of!(plugin_api__bindgen_ty_4, set_async_event_handler) - 16usize];
    ["Offset of field: plugin_api__bindgen_ty_4::dump_state"]
        [::std::mem::offset_of!(plugin_api__bindgen_ty_4, dump_state) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct plugin_api__bindgen_ty_5 {
    pub capture_open: ::std::option::Option<
        unsafe extern "C-unwind" fn(
            s: *mut ss_plugin_t,
            i: *const ss_plugin_capture_listen_input,
        ) -> ss_plugin_rc,
    >,
    pub capture_close: ::std::option::Option<
        unsafe extern "C-unwind" fn(
            s: *mut ss_plugin_t,
            i: *const ss_plugin_capture_listen_input,
        ) -> ss_plugin_rc,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of plugin_api__bindgen_ty_5"]
        [::std::mem::size_of::<plugin_api__bindgen_ty_5>() - 16usize];
    ["Alignment of plugin_api__bindgen_ty_5"]
        [::std::mem::align_of::<plugin_api__bindgen_ty_5>() - 8usize];
    ["Offset of field: plugin_api__bindgen_ty_5::capture_open"]
        [::std::mem::offset_of!(plugin_api__bindgen_ty_5, capture_open) - 0usize];
    ["Offset of field: plugin_api__bindgen_ty_5::capture_close"]
        [::std::mem::offset_of!(plugin_api__bindgen_ty_5, capture_close) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of plugin_api"][::std::mem::size_of::<plugin_api>() - 264usize];
    ["Alignment of plugin_api"][::std::mem::align_of::<plugin_api>() - 8usize];
    ["Offset of field: plugin_api::get_required_api_version"]
        [::std::mem::offset_of!(plugin_api, get_required_api_version) - 0usize];
    ["Offset of field: plugin_api::get_init_schema"]
        [::std::mem::offset_of!(plugin_api, get_init_schema) - 8usize];
    ["Offset of field: plugin_api::init"][::std::mem::offset_of!(plugin_api, init) - 16usize];
    ["Offset of field: plugin_api::destroy"][::std::mem::offset_of!(plugin_api, destroy) - 24usize];
    ["Offset of field: plugin_api::get_last_error"]
        [::std::mem::offset_of!(plugin_api, get_last_error) - 32usize];
    ["Offset of field: plugin_api::get_name"]
        [::std::mem::offset_of!(plugin_api, get_name) - 40usize];
    ["Offset of field: plugin_api::get_description"]
        [::std::mem::offset_of!(plugin_api, get_description) - 48usize];
    ["Offset of field: plugin_api::get_contact"]
        [::std::mem::offset_of!(plugin_api, get_contact) - 56usize];
    ["Offset of field: plugin_api::get_version"]
        [::std::mem::offset_of!(plugin_api, get_version) - 64usize];
    ["Offset of field: plugin_api::set_config"]
        [::std::mem::offset_of!(plugin_api, set_config) - 224usize];
    ["Offset of field: plugin_api::get_metrics"]
        [::std::mem::offset_of!(plugin_api, get_metrics) - 232usize];
    ["Offset of field: plugin_api::get_required_event_schema_version"]
        [::std::mem::offset_of!(plugin_api, get_required_event_schema_version) - 256usize];
};
